const { CardType } = require('../../gamePhases');

// 韩国英雄数据
const hanHeroes = [
  {
    id: 'H040',
    name: '韩昭侯',
    country: '韩',
    birthDeath: '前380-333',
    type: CardType.HERO,
    score: 10,
    goal: '韩国军事高于7，政理高于7，且拥有至少4枚称霸标记。如果游戏因韩国统一天下结束，你退出得分排名，直接共同获胜。',
    description: '韩国国君，重用申不害进行变法，因此韩国得以富强。晚年因申不害过世，变法未能良好延续。韩昭侯与秦国交战失利，闭门不出。费时三年造一高门，门成而未得出即殁。',
    quote: '二十六年，高门成，昭侯卒，果不出此门。——《史记·韩世家》'
  },
  {
    id: 'H041',
    name: '申不害',
    country: '韩',
    birthDeath: '前385-337',
    type: CardType.HERO,
    score: 2,
    goal: '申不害变法被打出结算。若你是在其打出的同一回合明置的此牌，获得2枚贡品标记。',
    description: '韩相，相韩15年，内修政教，外应诸侯，帮助韩昭侯推行"法"治、"术"治，使韩国君主专制得到加强，国内政局得到稳定，贵族特权受到限制，百姓生活渐趋富裕。',
    quote: '内修政教，外应诸侯，十五年。终申子之身，国治兵强，无侵韩者——《史记·老子韩非列传》'
  },
  {
    id: 'H042',
    name: '段规',
    country: '韩',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 6,
    goal: '韩国的经济高于9。',
    description: '晋臣，他先劝谏韩虎向智伯低头献上万家城邑，又联合赵，魏，杀死智伯。在瓜分领地时，他又建议韩虎夺取成皋为根据地。为韩国的建国发挥了重要作用。',
    quote: "王曰：\"善。\"果取成皋，至韩之取郑也，果从成皋始。——《战国策·韩策一》"
  },
  {
    id: 'H043',
    name: '韩宣惠王',
    country: '韩',
    birthDeath: '?-312',
    type: CardType.HERO,
    score: 4,
    goal: '韩国的军事低于秦国2点以上时，秦国在战争中战胜楚国。',
    description: '韩国第一位称王的君主。对秦策略从最初合纵派转为连横派，依附于秦。在位末年，联合秦军大败楚国。',
    quote: '威侯七年，与邯郸围襄陵。五月，梁惠王会威侯于巫沙。——《史记·韩世家》'
  },
  {
    id: 'H044',
    name: '张开地',
    country: '韩',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 0,
    goal: '你只能在任意回合开始时明置此牌。明置后，每个回合结束时，若韩国未灭亡，你获得1枚地利标记。若韩国已灭亡，你失去1枚贡品标记。',
    description: '政治家张良的祖父。先后辅佐韩昭侯、韩宣惠王、韩襄王三代君主，与儿子张平世称"五世相韩"。',
    quote: '留侯家五世相韩，留侯之大父曰开地、父曰平，相韩之五君。——《正一天师谱》'
  },
  {
    id: 'H045',
    name: '韩王安',
    country: '韩',
    birthDeath: '前280-226',
    type: CardType.HERO,
    score: 2,
    goal: '韩国灭亡。获得8枚贡品标记。每次韩国复辟成功，你都失去2枚贡品标记（不限于此牌获得的）。',
    description: '韩国亡国之君。在位9年。前231年，韩王安献出南阳。前230年，秦国派内史腾率师十万南下渡过黄河攻韩，一路势如破竹，几无抵抗，俘虏韩王安，以韩地建置颍川郡，韩国灭亡。',
    quote: '十七年，内史腾攻韩，得韩王安，尽纳其地，以其地为郡，命曰颍川。 ——《史记·秦始皇本纪》'
  },
  {
    id: 'H046',
    name: '张良',
    country: '韩',
    birthDeath: '前250-186',
    type: CardType.HERO,
    score: 6,
    goal: '场上有已灭亡的国家时，在秦国打出的刺杀结算成功。明置后，你可以选择获得2枚贡品标记，或获得2枚政理标记，将其任意分配在为灭亡的国家上。',
    description: '字子房，封为留侯，祖父张开地，父亲张平曾担任韩国相国。韩国被秦朝灭亡后，曾暗杀秦始皇失败，后隐姓埋名，受黄石公赠送《太公兵法》，潜心苦读十年大成。之后张良成为刘邦帐下的顶尖谋士，是汉朝的开国元勋之一。',
    quote: '张良未逐赤松去，桥边黄石知我心。——李白《扶风豪士歌》'
  },
  {
    id: 'H047',
    name: '韩非',
    country: '韩',
    birthDeath: '前281-233',
    type: CardType.HERO,
    score: 4,
    goal: '秦国政理或军事为全场最高。明置时，若二者皆为最高，获得4枚贡品标记。',
    description: '法家代表人物，杰出的思想家、哲学家和散文家。韩王之子，荀子学生，李斯同门师兄。韩非子认为应该要"法"、"术"、"势"三者并重，是法家学说的集大成者。',
    quote: '刑名有术，说难极知。悲彼周防，终亡李斯。——《史记索隐》'
  },
  {
    id: 'H048',
    name: '郑国',
    country: '韩',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 6,
    goal: '秦国的经济为0但未灭亡。明置时，秦国的经济增加至6。',
    description: '著名的水利工程师。韩国想消耗秦国的国力，便让水工郑国游说秦国，凿通泾水，从中山以西到瓠口修一条水渠。此举适得其反，渠成后，秦国富强起来，渠也因此被命名为郑国渠。',
    quote: '臣为韩延数年之命，然渠成，亦秦万世之利也。——《资治通鉴》'
  },
  {
    id: 'H049',
    name: '韩珉',
    country: '韩',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 6,
    goal: '可以在争雄阶段明置。你在一次盟主争雄中使用了至少8枚地利标记获得盟主之位。',
    description: '韩国人。《战国策》又作公仲珉，《史记》作韩聂，《战国纵横家书》作韩量。曾被齐闵王任命为齐国相国，后来在韩国为相。',
    quote: "王曰：\"吾欲以国辅韩珉而相之，可乎?\" —— 《战国策·韩策三》"
  },
  {
    id: 'H050',
    name: '暴鸢',
    country: '韩',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 4,
    goal: '韩国的军事超过其经济和政理都至少3。',
    description: '战国时期的韩国名将，曾参与过垂沙之战、伊阙之战等。在垂沙之战中，暴鸢与齐国将领匡章、魏国将领公孙喜共同攻打楚国的方城，击败楚军，俘虏楚国将领唐眜。',
    quote: '齐使章子，魏使公孙喜，韩使暴鸢共攻楚方城，取唐眜。——《史记·秦本纪》'
  },
  {
    id: 'H051',
    name: '侠累',
    country: '韩',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 4,
    goal: '齐国的国力在一回合内下降超过3。',
    description: '韩傀，字侠累。韩国贵族。韩烈侯在位初期，侠累任韩国的相邦，与濮阳的严仲子争权，严仲子失败，出走齐国。后严仲子雇刺客聂政，侠累被刺杀。',
    quote: '聂政之刺韩傀也，白虹贯日。—— 《战国策·魏策四》'
  },
  {
    id: 'H052',
    name: '聂政',
    country: '韩',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 0,
    goal: '你只能在任意回合开始时明置此牌。你可以弃置2枚贡品标记，然后指定一名玩家。该玩家需要选择其1张暗置的英杰牌移出游戏。若此时韩国已灭亡，你可以收回弃置的贡品标记。',
    description: '著名的刺客，受严仲子雇佣刺杀侠累，力战至死。聂政自知无法脱困，怕连累亲人遭到族诛，反以剑自毁颜面、削双目，再切腹自杀。',
    quote: '聂政大呼，所击杀者数十人，因自皮面决眼，自屠出肠，遂以死。——《史记·刺客列传》'
  }
];

module.exports = hanHeroes; 