const { CardType } = require('../../gamePhases');

// 秦国英雄数据
const qinHeroes = [
  {
    id: 'Q079',
    name: '张仪',
    country: '秦',
    birthDeath: '370-310',
    type: CardType.HERO,
    score: 10,
    goal: '第六回合结束时，秦国为拥有最多称霸标记的唯一国家。明置时，你可以指定秦国以外的一国，第七回合无法增加属性（仍可以减少）',
    description: '著名的纵横家。同为鬼谷子门下，提倡"连横"，即秦国联合其他诸侯国中的几个，然后对抗其他的诸侯国，多次破坏了六国的合纵。促使各国亲善秦国，受封为武信君。',
    quote: '今吾幸先用，而能用秦柄者，独张仪可耳。——《史记·张仪列传》'
  },
  {
    id: 'Q080',
    name: '商鞅',
    country: '秦',
    birthDeath: '390-338',
    type: CardType.HERO,
    score: 8,
    goal: '秦国有两项属性为全场最高。明置时，秦国政理+1',
    description: '政治家，法家代表人物。他改革了秦国的户籍、法律、军功爵位、土地制度、行政区划、税收、度量衡以及民风民俗；重农抑商、奖励耕织。令秦国国力强盛。',
    quote: '当是时也，商君佐之，内立法度，务耕织，修守战之具。——贾谊《过秦论》'
  },
  {
    id: 'Q081',
    name: '公孙衍',
    country: '秦',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 6,
    goal: '秦国政理值高于7。明置时，魏国军事+1，并获得1枚称霸标记。',
    description: '原魏国人，仕于秦国。张仪到秦国后，与公孙衍明争暗斗，最终挤掉公孙衍。气急败坏的公孙衍回到魏国，魏惠王任用他为将。公孙衍主导"五国相王"，抗衡秦国并与张仪继续斗争。',
    quote: '今王以衍为可使将，故用之也。——《战国策·魏策一》'
  },
  {
    id: 'Q082',
    name: '秦惠文王',
    country: '秦',
    birthDeath: '356-311',
    type: CardType.HERO,
    score: 4,
    goal: '秦国在一场史实战争中战胜。若此时商鞅已被明置，你可以获得1枚贡品标记。',
    description: '年十九即位，公元前325年改"公"称"王"，次年更元，成为秦国第一王。当政期间，北扫义渠，西平巴蜀，东出函谷，南下商於，为秦统一中国打下坚实基础。',
    quote: '南取汉中，西举巴蜀，东割膏腴之地，北收要害之郡。——贾谊《过秦论》'
  },
  {
    id: 'Q083',
    name: '樗里疾',
    country: '秦',
    birthDeath: '370-300',
    type: CardType.HERO,
    score: 2,
    goal: '秦国军事值高于6，明置后，你可以选择：获得1枚贡品标记，或在未灭亡的国家之间移动1枚军事标记。',
    description: '秦国宗室将领，秦孝公庶子。能说会道，足智多谋，绰号"智囊"。秦武王时战功卓著的樗里子任右丞相，扩张秦国版图。又传说能预言风水，被后世堪舆家尊之为"樗里先师"。',
    quote: '秦令樗里疾以车百乘入周，周君迎之以卒，甚敬。——《战国策·西周策》'
  },
  {
    id: 'Q084',
    name: '嬴政',
    country: '秦',
    birthDeath: '259-210',
    type: CardType.HERO,
    score: 10,
    goal: '游戏结束时，秦国国力是全场唯一最高。如果游戏因秦国统一天下结束，你退出得分排名，直接共同获胜。',
    description: '即秦始皇。他统一六国，是中国史上第一位使用"皇帝"称号的君主。他统一度量衡，"车同轨，书同文，行同伦"，奠定了中国政治史上两千余年之专制政治格局，被誉为"千古一帝"。',
    quote: '秦王扫六合，虎视何雄哉。——李白《古风》'
  },
  {
    id: 'Q085',
    name: '王翦',
    country: '秦',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 8,
    goal: '燕国或赵国在与秦国的战争中战败而灭亡，明置时，秦国军事+1。',
    description: '秦国名将，关中频阳东乡人，破赵国都城邯郸，消灭燕和赵；以秦国绝大部分兵力消灭楚国后，接着率领平楚大军南下平定百越。与白起、廉颇、李牧并称战国四大名将',
    quote: '始皇二十六年，尽并天下，王氏、蒙氏功为多，名施于后世。——《史记·白起王翦列传》'
  },
  {
    id: 'Q086',
    name: '白起',
    country: '秦',
    birthDeath: '332-257',
    type: CardType.HERO,
    score: 8,
    goal: '秦国的军事值高于所有其他国家至少3点且拥有至少3枚称霸标记。游戏结束时，鄢郢之战、华阳之战、陉城之战、长平之战每被打出一张，你获得1枚贡品标记。',
    description: '军事家、秦国名将。担任秦国将领30多年，攻城70余座，歼灭近百万敌军，未尝一败，被封为武安君。有伊阙之战、鄢郢之战、华阳之战、陉城之战和长平之战等辉煌胜利。',
    quote: '白起料敌合变，出奇无穷，声震天下。——《史记·白起王翦列传》'
  },
  {
    id: 'Q087',
    name: '李斯',
    country: '秦',
    birthDeath: '284-208',
    type: CardType.HERO,
    score: 2,
    goal: '秦国执行了变法。明置时，秦国政理+1。游戏结束时，若谏逐客书被打出，你获得1枚贡品标记。',
    description: '著名的政治家、文学家。早年师从荀子学习帝王之术，学成后进入秦国，秦王政采纳其计谋，遣谋士持金玉游说关东六国，离间各国君臣，又任命其为客卿。著有《谏逐客书》。',
    quote: '古来如李斯、曹操、董卓、杨素，其智力皆横绝一世。——《曾国藩家书》'
  },
  {
    id: 'Q088',
    name: '赵高',
    country: '秦',
    birthDeath: '258-207',
    type: CardType.HERO,
    score: 6,
    goal: '秦国政理低于3，但未灭亡。',
    description: '历仕秦始皇、秦二世和秦王子婴三代君主，沙丘之变和望夷宫之变的主谋、策划者。赵高引发的多次秦朝内部宫廷混乱是造成秦朝加速灭亡的原因之一。',
    quote: '问左右，左右或默，或言马以阿顺赵高。——《史记·秦始皇本纪》'
  },
  {
    id: 'Q089',
    name: '蒙恬',
    country: '秦',
    birthDeath: '250-210',
    type: CardType.HERO,
    score: 2,
    goal: '秦国在一个回合内没有进行战争。明置时，秦国经济+1。',
    description: '秦朝名将，祖居齐国，祖父蒙骜和父亲蒙武皆为秦国名将。蒙恬北防匈奴多年，筑长城，却匈奴七百余里，威震北方。秦始皇驾崩后，因为支持太子扶苏，被赵高设计处决。',
    quote: '乃使蒙恬，北筑长城而守藩篱，却匈奴七百余里。——贾谊《过秦论》'
  },
  {
    id: 'Q090',
    name: '范雎',
    country: '秦',
    birthDeath: '不详-255',
    type: CardType.HERO,
    score: 2,
    goal: '远交近攻被打出结算。若你是在其打出的同一回合明置的此牌，获得2枚贡品标记。',
    description: '著名政治家、军事谋略家，秦国宰相，又称为"应侯"。 范雎见秦昭王之后，提出了远交近攻的策略，主张将韩、魏作为秦国兼并的主要目标，同时应该与齐国等保持良好关系。',
    quote: '先生乃幸至此，此天以寡人慁先生，而存先王之庙也。——《范雎说秦王》'
  },
  {
    id: 'Q091',
    name: '司马错',
    country: '秦',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 1,
    goal: '你以秦国为目标打出援兵后可以明置。明置后，若秦国在本次战争中战胜，其军事+1。',
    description: '秦国名将，司马迁八世祖，曾跟相国张仪有过争论，主张"得蜀即得楚"。秦惠文王九年，率军灭亡蜀国，平定陈庄之乱。后率军南下东攻楚国，迫使楚国献出汉水以北和上庸之地。',
    quote: '蜀既属，秦益强富厚，轻诸侯。 ——《战国策·秦策一》'
  }
];

module.exports = qinHeroes; 