const { CardType } = require('../../gamePhases');

// 魏国英雄数据
const weiHeroes = [
  {
    id: 'W066',
    name: '魏文侯',
    country: '魏',
    birthDeath: '不详-396',
    type: CardType.HERO,
    score: 10,
    goal: '回合结束时，魏国的三项属性均为全场最高。明置时，你可以执行一次求贤，并任意保留或弃置摸到的英杰牌。',
    description: '魏国雄主，百年霸业的开创者。魏文侯在战国七雄中首先实行变法，改革政治，奖励耕战，兴修水利，发展封建经济，在赵与韩攘外之时魏国率先安内，造就盛世。',
    quote: "文侯问于群臣曰：\"我何如主？\"皆曰：\"仁君。\"——《资治通鉴》"
  },
  {
    id: 'W067',
    name: '李悝',
    country: '魏',
    birthDeath: '455-395',
    type: CardType.HERO,
    score: 8,
    goal: '同一回合内，魏国国力（三项属性和）增加超过5。',
    description: '魏国相国，主持变法。在经济方面，实行"善平籴"政策，以平抑粮价；政治上实行法治，废除世卿世禄制度，按照功劳和能力提拔官吏。变法后，魏国国力大大增强。',
    quote: '籴不贵而民不散，取有余而补不足也。——《智囊全集》'
  },
  {
    id: 'W068',
    name: '魏武侯',
    country: '魏',
    birthDeath: '?-370',
    type: CardType.HERO,
    score: 6,
    goal: '同一回合内，魏国进行两次战争并均战胜。明置时，魏国军事+1。',
    description: '魏文侯之子，一生南征北战。击退秦国，横扫河西，败齐国，打败楚国，压制赵国，将魏国的百年霸业再一次推向高峰。',
    quote: '魏武侯谋事而当，群臣莫能逮。——《荀子·尧问》'
  },
  {
    id: 'W069',
    name: '段干木',
    country: '魏',
    birthDeath: '475-396',
    type: CardType.HERO,
    score: 4,
    goal: '一轮出牌中，没有任何事件牌的目标包含魏国。明置时，魏国政理+1。',
    description: '魏国隐士，其数名好友先后为将，唯段干木清高隐居。文侯求贤若渴，每过段干木家门，扶轼致敬，以示其诚，终于感动了段干木出山。帮助文侯称霸中原。',
    quote: '此非段干木之闾乎？段干木盖贤者也，吾安敢不轼？——《新序》'
  },
  {
    id: 'W070',
    name: '公叔座',
    country: '魏',
    birthDeath: '不详-360',
    type: CardType.HERO,
    score: 2,
    goal: '其他玩家共明置了至少三张魏国英杰牌。',
    description: '魏国的相国。曾大胜韩赵联军，受赏四十万亩良田。公叔痤病重时向魏王推荐商鞅，如果不能用，就杀之，魏王不以为然。公叔痤知道商鞅不会被重用，便让商鞅逃走。',
    quote: '公叔痤知其贤，未及进。——《史记·商君列传》'
  },
  {
    id: 'W071',
    name: '魏惠王',
    country: '魏',
    birthDeath: '410-319',
    type: CardType.HERO,
    score: 10,
    goal: '游戏结束时，魏国国力是全场唯一最高。如果游戏因魏国统一天下结束，你退出得分排名，直接共同获胜。',
    description: '魏国在位时间最长的君主。即位时魏国由盛至衰。主要原因为政治立场不坚定，四面树敌，有野心但能力不足。以败齐为始，魏国一蹶不振，屡屡受挫于秦。',
    quote: '魏惠王之所以身不死，国不分者，二国之谋不和也。——《资治通鉴》'
  },
  {
    id: 'W072',
    name: '西门豹',
    country: '魏',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 0,
    goal: '你可以在任意事件牌结算后明置此牌。明置时，魏国的军事/经济/政理中每有一项高于8，你获得3枚贡品标记。',
    description: '魏国安邑人，政治家及水利专家，曾立下赫赫战功。邺令任内，破除"河伯娶妇"的陋习，又带领民众开凿了十二条运河，引河水灌溉民田，后称西门豹渠。',
    quote: '西门豹即发民凿十二渠，引河水灌民田，田皆溉。——《史记·滑稽列传》'
  },
  {
    id: 'W073',
    name: '庞涓',
    country: '魏',
    birthDeath: '不详-342',
    type: CardType.HERO,
    score: 8,
    goal: '魏国在一场战争中获得庙算，及至少两次援兵并最终战胜。',
    description: '军事家，曾为魏国将军，因妒贤，迫害同学孙膑，膑其足，黥其颜，使孙膑逃至齐国。后在桂陵之战被孙膑俘虏，通过调停后被释放。马陵之战中跟太子申一起败于田盼后阵亡。',
    quote: '孙子弗息而击之桂陵，而擒庞涓。——《孙膑兵法》'
  },
  {
    id: 'W074',
    name: '信陵君',
    country: '魏',
    birthDeath: '300-243',
    type: CardType.HERO,
    score: 2,
    goal: '窃符救赵被打出结算。若你是在其打出的同一回合明置的此牌，获得2枚贡品标记。',
    description: '名无忌，是魏昭王的儿子。著名的政治家、军事家，魏安釐王时期官至魏国上将军，战国四公子之一。为人仁爱宽厚，礼贤下士，威名远扬，各诸侯国连续十多年都不敢侵犯魏国。',
    quote: '公子为人仁而下士，士无贤不肖皆谦而礼交之。——《史记·信陵君列传》'
  },
  {
    id: 'W075',
    name: '朱亥',
    country: '魏',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 6,
    goal: '魏国军事高于7，且比韩国与赵国拥有更多的称霸标记。',
    description: '有勇力，隐身市井之中当屠夫，居于大梁。魏安嫠王十九年，因侯赢的推荐，成了信陵君的上宾，并帮助信陵君以四十斤铁锤击杀将军晋鄙，夺取兵权，解救赵国。',
    quote: '三杯吐然诺，五岳倒为轻。 ——李白《侠客行》'
  },
  {
    id: 'W076',
    name: '惠施',
    country: '魏',
    birthDeath: '370-310',
    type: CardType.HERO,
    score: 0,
    goal: '任意回合结束时，你可以弃置2枚地利标记明置此牌。明置后，任意骰子扔出后，其生效前，你可以弃2枚贡品标记，将其重新投掷。',
    description: '名家代表人物、辩客和哲学家。惠施是合纵抗秦的最主要的组织人和支持者。魏文惠王在位时，惠施因为与张仪不和而被驱逐出魏国，后来回到家乡宋国，并与庄子成为好友。',
    quote: '子非鱼，安知鱼之乐？——《庄子·秋水》'
  },
  {
    id: 'W077',
    name: '侯嬴',
    country: '魏',
    birthDeath: '不详-257',
    type: CardType.HERO,
    score: 4,
    goal: '一场战争因为"周天子"处于魏国而被跳过结算。',
    description: '秦国围攻赵国都城邯郸时，侯嬴为信陵君谋划，定计让如姬盗出宫中虎符，并让力士朱亥陪同信陵君，威夺晋鄙兵权以救赵，史称"信陵君窃符救赵"。',
    quote: '将炙啖朱亥，持觞劝侯嬴。 ——李白《侠客行》'
  },
  {
    id: 'W078',
    name: '如姬',
    country: '魏',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 0,
    goal: '其他玩家明置一张英杰牌时，若其仍有未明置的英杰牌，你可以弃置1枚贡品标记。将此牌交与该玩家。然后，你可以获得一张其未明置的英杰牌。此牌明置，交换来的英杰依然暗置。',
    description: '魏国魏安僖王的宠姬。其父被人所杀，她欲报仇，三年而不得，信陵君帮助她，派门客将其杀父仇人杀死。秦国围攻赵国都城邯郸时，如姬盗出宫中虎符，解了赵国邯郸之围。',
    quote: '如姬之欲为公子死，无所辞，顾未有路耳。——《史记·信陵君列传》'
  }
];

module.exports = weiHeroes; 