const { CardType } = require('../../gamePhases');

// 燕国英雄数据
const yanHeroes = [
  {
    id: 'Y027',
    name: '燕王哙',
    country: '燕',
    birthDeath: '前370-314',
    type: CardType.HERO,
    score: 2,
    goal: '燕国灭亡。获得X枚贡品标记，X为剩余的天时牌数量。每次燕国复辟成功，你都失去2枚贡品标记（不限于此牌获得的）。',
    description: '燕国第三十八任国君。他好贤行仁，效仿尧的禅让之举，禅让君位于宰相子之，企图进行改革，使得燕国大乱。后来齐宣王发兵攻燕，城破身死。',
    quote: '燕哙无道，禅位子之。——《史记索隐》'
  },
  {
    id: 'Y028',
    name: '苏秦',
    country: '燕',
    birthDeath: '前330-284',
    type: CardType.HERO,
    score: 8,
    goal: '你只能在任意回合开始时明置此牌。秦国灭亡，或没有任何一项属性是全场最高或次高。你明置此牌的回合内，秦国将无法增加属性（仍可以减少）',
    description: '著名纵横家，他刻苦攻读后游说列国。提出合纵六国以抗秦的战略思想，兼任六国国相，以一己之身佩六国相印，使秦十五年不敢出函谷关。纵观历史，空前绝后。',
    quote: '六国从合而并力焉。苏秦为从约长，并相六国。——《史记·苏秦列传》'
  },
  {
    id: 'Y029',
    name: '郭隗',
    country: '燕',
    birthDeath: '前351-297',
    type: CardType.HERO,
    score: 2,
    goal: '千金买骨被打出结算。若你是在其打出的同一回合明置的此牌，获得2枚贡品标记。',
    description: '燕昭王重臣，他以千金买骨为例，燕昭王广纳贤才。燕昭王于是郭隗修建豪华的宫殿并尊他为师。各国贤士听闻后纷纷投奔燕国。使燕国逐渐强盛。',
    quote: '君不见昔时燕家重郭隗，拥篲折节无嫌猜。—— 李白《行路难》'
  },
  {
    id: 'Y030',
    name: '燕后文公',
    country: '燕',
    birthDeath: '?-333',
    type: CardType.HERO,
    score: 6,
    goal: '秦国军事值低于4，或秦国灭亡。游戏结束时，若秦国灭亡，获得2枚贡品标记。',
    description: '亦称燕文侯。燕后桓公之子，燕国国君。采纳了苏秦的合纵之策，和赵、韩、魏、齐、楚五国联合组成合纵联盟，共同对抗秦国。',
    quote: '文公从赵，苏秦骋辞。——《史记索隐》'
  },
  {
    id: 'Y031',
    name: '秦开',
    country: '燕',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 2,
    goal: '燕国执行了外交。明置时，你可以查看史实牌堆，若其中有"秦开却胡"，你可以获得之。',
    description: '燕国将领，早年在东胡做人质，很受东胡的信任，通晓民情风俗。燕昭王即位后，秦开逃归燕国。后于前300年大破东胡，迫使东胡北退千余里。',
    quote: '燕有贤将秦开，为质于胡，胡甚信之。归而袭破走东胡，东胡却千余里。——《史记.匈奴列传》'
  },
  {
    id: 'Y032',
    name: '燕昭王',
    country: '燕',
    birthDeath: '前330-279',
    type: CardType.HERO,
    score: 10,
    goal: '燕国的三项属性均为全场最高。明置时，你可以执行一次求贤，并任意保留或弃置摸到的英杰牌。如果游戏因燕国统一天下结束，你退出得分排名，直接共同获胜。',
    description: '早年进入韩国为质。燕国的子之之乱平定后，由赵武灵王派送回国即位位王。即位之后，招贤纳士，命令秦开大破东胡、朝鲜、真番。造就了燕国一时盛世。',
    quote: '南登碣石馆，遥望黄金台。丘陵尽乔木，昭王安在哉？ ——陈子昂《燕昭王》'
  },
  {
    id: 'Y033',
    name: '乐毅',
    country: '燕',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 8,
    goal: '燕国与齐国的战争导致齐国灭亡。',
    description: '燕国的著名军事家，魏将乐羊后裔，拜燕上将军。公元前284年，他统帅燕国等五国联军攻打齐国，连下70余城，创造了中国古代战争史上以弱胜强的著名战例，报了强齐伐燕之仇。',
    quote: '乐毅留徇齐五岁，下齐七十馀城，皆为郡县以属燕。——《史记·乐毅列传》'
  },
  {
    id: 'Y034',
    name: '太子丹',
    country: '燕',
    birthDeath: '不详-226',
    type: CardType.HERO,
    score: 8,
    goal: '存在一个国家的军事、政理、称霸标记数均至少为燕国的2倍。明置时，可以视作打出一张刺杀。',
    description: '战国末期燕国太子。当时秦已攻灭韩、赵等国，次将及燕。他策划了荆轲刺秦王事件来阻挡秦国的兼并之势，事情败露后，燕王便杀太子丹，将其头颅献给秦军以求和。',
    quote: '此地别燕丹，壮士发冲冠。昔时人已没，今日水犹寒。——骆宾王《于易水送人》'
  },
  {
    id: 'Y035',
    name: '荆轲',
    country: '燕',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 6,
    goal: '秦国拥有至少3枚称霸标记时，以秦国为目标的刺杀结算成功。明置时，可以视作打出一张刺杀。',
    description: '著名刺客，受燕太子丹之托刺秦王嬴政，荆轲带着燕督亢地图和樊於期首级，前往秦国。秦王在咸阳宫隆重召见了他，在献督亢之地图后，图穷匕见，可惜荆轲刺秦王不中，功亏一篑。',
    quote: '风萧萧兮易水寒，壮士一去兮不复还！——荆轲'
  },
  {
    id: 'Y036',
    name: '盖聂',
    country: '燕',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 4,
    goal: '在任意国家打出的复辟结算成功。明置时，可以视作打出一张刺杀。',
    description: '卫国剑客，剑术高明，相传为当世第一剑客，史料记载并不多。荆轲曾游历经过榆次，与盖聂讲论剑术。盖聂发怒，瞪着眼看荆轲，荆轲便离开了。二人不欢而散。',
    quote: '荆轲尝游过榆次，与盖聂论剑，盖聂怒而目之。——《史记·刺客列传》'
  },
  {
    id: 'Y037',
    name: '高渐离',
    country: '燕',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 2,
    goal: '燕国参与的一场战争中议和结算成功。明置时，可以视作打出一张刺杀。',
    description: '荆轲之友。秦灭燕后，秦王爱惜他的才艺，免其死罪，用马粪熏瞎双眼，让他在宫中击筑。一日高渐离将筑灌了铅，趁秦王听音乐入迷之时，向秦王击去，可惜未中，被秦王诛杀。',
    quote: '于是遂诛高渐离，终身不复近诸侯之人。——《史记·刺客列传》'
  },
  {
    id: 'Y038',
    name: '荆天明',
    country: '燕',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 2,
    goal: '在任意国家打出的刺杀结算成功。明置时，可以视作打出一张刺杀。',
    description: '虚构人物，中国3D武侠动画《秦时明月》的第一男主角，父亲是绝顶剑客荆轲，母亲是倾国倾城的丽姬。为人古灵精怪却又有些不知天高地厚，但十分重义气。',
    quote: '手中的剑为什么而挥动，只有靠你自己去寻找答案。 ——盖聂'
  },
  {
    id: 'Y039',
    name: '秦舞阳',
    country: '燕',
    birthDeath: '不详',
    type: CardType.HERO,
    score: 0,
    goal: '在一张刺杀结算前，你可以弃置2枚贡品标记，明置此牌，使该刺杀直接失败并被弃置。',
    description: '燕国名将秦开之孙。十三岁时就犯下杀人案，没人敢用正眼看他。后燕太子丹让他担任荆轲的副手，赴咸阳刺秦。然而在朝廷之上，身为副手的秦舞阳却面色惊恐，险些败露。',
    quote: '燕国有勇士秦武阳，年十二，杀人，人不敢与忤视。——《史记·刺客列传》'
  }
];

module.exports = yanHeroes; 